VPro/src/Documents/LoanInterestCommissionAccruals/LoanInterestCommissionAccruals.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LoanInterestCommissionAccruals</name>
  <registerRecords>AccountingRegister.Managerial</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccumulationRegister.LoanSettlements</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationType</name>
    <type>
      <types>EnumRef.LoanAccrualTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Accruals</name>
    <attributes>
      <name>AmountType</name>
      <type>
        <types>EnumRef.LoanScheduleAmountTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Lender</name>
      <type>
        <types>CatalogRef.Counterparties</types>
      </type>
    </attributes>
    <attributes>
      <name>LoanContract</name>
      <type>
        <types>DocumentRef.LoanContract</types>
      </type>
    </attributes>
    <attributes>
      <name>SettlementsCurrency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VPro/src/InformationRegisters/LoanRepaymentSchedule/LoanRepaymentSchedule.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LoanRepaymentSchedule</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Principal</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Interest</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Commission</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>LoanContract</name>
    <type>
      <types>DocumentRef.LoanContract</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/AccumulationRegisters/LoanSettlements/LoanSettlements.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>LoanSettlements</name>
  <resources>
    <name>PrincipalDebt</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>PrincipalDebtCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Interest</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>InterestCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Commission</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>CommissionCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>DeductedFromSalary</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <dimensions>
    <name>LoanKind</name>
    <type>
      <types>EnumRef.LoanContractTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LoanContract</name>
    <type>
      <types>DocumentRef.LoanContract</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

VPro/src/Enums/LoanAccrualTypes/LoanAccrualTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanAccrualTypes</name>
  <enumValues>
    <name>AccrualsForEmployeeLoans</name>
  </enumValues>
  <enumValues>
    <name>AccrualsForLoansBorrowed</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/LoanContractTypes/LoanContractTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanContractTypes</name>
  <enumValues>
    <name>EmployeeLoanAgreement</name>
  </enumValues>
  <enumValues>
    <name>Borrowed</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/LoanScheduleAmountTypes/LoanScheduleAmountTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanScheduleAmountTypes</name>
  <enumValues>
    <name>Principal</name>
  </enumValues>
  <enumValues>
    <name>Interest</name>
  </enumValues>
  <enumValues>
    <name>Commission</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Catalogs/Counterparties/Counterparties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Counterparties</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccountByDefault</name>
    <comment>Bank account by default</comment>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByContracts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackPaymentsByBills</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntityIndividual</name>
    <type>
      <types>EnumRef.CounterpartyKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessGroup</name>
    <type>
      <types>CatalogRef.CounterpartiesAccessGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractByDefault</name>
    <comment>Default counterparty contract</comment>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>BasicInformation</name>
    <comment>It used to search in the list</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvancesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountCustomerSettlements</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountVendorSettlements</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvancesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationCountry</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAcquisitionChannel</name>
    <type>
      <types>CatalogRef.CustomerAcquisitionChannels</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Supplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OtherRelationship</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfBirth</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.IndividualGender</types>
    </type>
  </attributes>
  <attributes>
    <name>VATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LegalForm</name>
    <type>
      <types>CatalogRef.LegalForms</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Region</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EmailAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tags</name>
    <attributes>
      <name>Tag</name>
      <type>
        <types>CatalogRef.Tags</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ActivityTypes</name>
    <attributes>
      <name>ActivityType</name>
      <type>
        <types>CatalogRef.ActivityTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Documents/LoanInterestCommissionAccruals/Forms/FillingForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("Autotest") Then // Skipping the initialization to guarantee that the form will be received if the Autotest parameter is passed.
		Return;
	EndIf;

	Company					= Parameters.Company;
	AccrualAddressInStorage	= Parameters.AccrualAddressInStorage;
	OperationType			= Parameters.OperationKind;
	StartDate				= Parameters.StartDate;
	EndDate					= Parameters.EndDate;
	Recorder				= Parameters.Recorder;
	
	SetContractSelectionParameters();
	
	If OperationType = Enums.LoanAccrualTypes.AccrualsForLoansBorrowed Then
		Items.Employee.Visible = False;
	Else
		Items.Counterparty.Visible = False;
	EndIf;
	
	NewArray = New Array();
	
	If OperationType = Enums.LoanAccrualTypes.AccrualsForLoansBorrowed Then
		NewParameter = New ChoiceParameter("Filter.LoanKind", Enums.LoanContractTypes.Borrowed);
		Items.FillInByContractsWithRepaymentFromSalary.Visible = False;
	Else
		NewParameter = New ChoiceParameter("Filter.LoanKind", Enums.LoanContractTypes.EmployeeLoanAgreement);
		Items.FillInByContractsWithRepaymentFromSalary.Visible = True;
	EndIf;
	
	NewArray.Add(NewParameter);
	NewParameters = New FixedArray(NewArray);
	Items.LoanContract.ChoiceParameters = NewParameters;
	
EndProcedure

#EndRegion

#Region FormHeaderItemEventHandlers

&AtClient
Procedure CounterpartyOnChange(Item)
	SetContractSelectionParameters();
EndProcedure

&AtClient
Procedure EmployeeOnChange(Item)	
	SetContractSelectionParameters();	
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure Fill(Command)

	AccrualsServer();
	
	Structure = New Structure("AccrualAddressInStorage", AccrualAddressInStorage);
	NotifyChoice(Structure);

EndProcedure

#EndRegion

#Region InternalProceduresAndFunctions

#Region Others

&AtServer
Function SetContractSelectionParameters()

	ParameterArray = New Array;
	ParameterArray.Add(New ChoiceParameter("Filter.Company", Company));
	
	If OperationType = Enums.LoanAccrualTypes.AccrualsForLoansBorrowed Then	
		ParameterArray.Add(New ChoiceParameter("Filter.LoanKind", Enums.LoanContractTypes.Borrowed));
		
		If Not Counterparty.IsEmpty() Then
			ParameterArray.Add(New ChoiceParameter("Filter.Lender", Counterparty));
		EndIf;
	Else
		ParameterArray.Add(New ChoiceParameter("Filter.LoanKind", Enums.LoanContractTypes.EmployeeLoanAgreement));
		
		If Not Employee.IsEmpty() Then
			ParameterArray.Add(New ChoiceParameter("Filter.Employee", Employee));
		EndIf;
	EndIf;
	
	ParameterArray.Add(New ChoiceParameter("Filter.DeletionMark", False));
	
	Items.LoanContract.ChoiceParameters = New FixedArray(ParameterArray);
	
EndFunction

&AtServer
Function QueryTextByAccruals()
	
	Return 
	"SELECT
	|	LoanRepaymentSchedule.Period,
	|	LoanRepaymentSchedule.LoanContract AS LoanContract,
	|	SUM(LoanRepaymentSchedule.Interest) AS Interest,
	|	SUM(LoanRepaymentSchedule.Commission) AS Commission,
	|	CASE
	|		WHEN LoanRepaymentSchedule.LoanContract.LoanKind = VALUE(Enum.LoanContractTypes.Borrowed)
	|			THEN LoanRepaymentSchedule.LoanContract.Counterparty
	|		ELSE LoanRepaymentSchedule.LoanContract.Employee
	|	END AS Lender,
	|	LoanRepaymentSchedule.LoanContract.Company AS Company,
	|	LoanRepaymentSchedule.LoanContract.LoanKind AS LoanKind,
	|	LoanRepaymentSchedule.LoanContract.SettlementsCurrency AS SettlementsCurrency
	|INTO CurrentAccruals
	|FROM
	|	InformationRegister.LoanRepaymentSchedule AS LoanRepaymentSchedule
	|WHERE
	|	LoanRepaymentSchedule.Active
	|	AND LoanRepaymentSchedule.Period BETWEEN &StartDate AND &EndDate
	|	AND LoanRepaymentSchedule.LoanContract.Company = &Company
	|	AND LoanRepaymentSchedule.LoanContract.LoanKind = &LoanKind
	|
	|GROUP BY
	|	LoanRepaymentSchedule.Period,
	|	LoanRepaymentSchedule.LoanContract,
	|	CASE
	|		WHEN LoanRepaymentSchedule.LoanContract.LoanKind = VALUE(Enum.LoanContractTypes.Borrowed)
	|			THEN LoanRepaymentSchedule.LoanContract.Counterparty
	|		ELSE LoanRepaymentSchedule.LoanContract.Employee
	|	END,
	|	LoanRepaymentSchedule.LoanContract.LoanKind,
	|	LoanRepaymentSchedule.LoanContract.Company,
	|	LoanRepaymentSchedule.LoanContract.SettlementsCurrency
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	LoanSettlements.Period,
	|	LoanSettlements.LoanKind,
	|	LoanSettlements.Counterparty,
	|	LoanSettlements.LoanContract,
	|	LoanSettlements.Company,
	|	SUM(LoanSettlements.InterestCur) AS InterestCur,
	|	SUM(LoanSettlements.CommissionCur) AS CommissionCur,
	|	LoanSettlements.LoanContract.SettlementsCurrency AS SettlementsCurrency
	|INTO PreviousAccruals
	|FROM
	|	AccumulationRegister.LoanSettlements AS LoanSettlements
	|WHERE
	|	LoanSettlements.Period BETWEEN &StartDate AND &EndDate
	|	AND LoanSettlements.Recorder <> &Recorder
	|	AND LoanSettlements.LoanKind = &LoanKind
	|	AND LoanSettlements.Company = &Company
	|	AND LoanSettlements.Active
	|
	|GROUP BY
	|	LoanSettlements.LoanContract,
	|	LoanSettlements.Period,
	|	LoanSettlements.LoanKind,
	|	LoanSettlements.Company,
	|	LoanSettlements.Counterparty,
	|	LoanSettlements.LoanContract.SettlementsCurrency
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	CurrentAccruals.Period AS Date,
	|	CurrentAccruals.LoanContract AS LoanContract,
	|	CurrentAccruals.Interest,
	|	CurrentAccruals.Commission,
	|	CAST(CurrentAccruals.Lender AS Catalog.Counterparties) AS Lender,
	|	CAST(CurrentAccruals.Lender AS Catalog.Employees) AS Employee,
	|	CurrentAccruals.Company,
	|	CurrentAccruals.LoanKind,
	|	CurrentAccruals.SettlementsCurrency,
	|	0 AS Total,
	|	CurrentAccruals.LoanContract.ChargeFromSalary AS ChargeFromSalary
	|FROM
	|	CurrentAccruals AS CurrentAccruals
	|		LEFT JOIN PreviousAccruals AS PreviousAccruals
	|		ON CurrentAccruals.Period = PreviousAccruals.Period
	|			AND CurrentAccruals.LoanContract = PreviousAccruals.LoanContract
	|			AND CurrentAccruals.Lender = PreviousAccruals.LoanKind
	|			AND CurrentAccruals.SettlementsCurrency = PreviousAccruals.SettlementsCurrency
	|WHERE
	|	PreviousAccruals.Period IS NULL
	|{WHERE
	|	(CAST(CurrentAccruals.Lender AS Catalog.Counterparties)).* AS Lender,
	|	(CAST(CurrentAccruals.Lender AS Catalog.Employees)).* AS Employee,
	|	CurrentAccruals.LoanContract.*,
	|	CurrentAccruals.LoanContract.ChargeFromSalary AS ChargeFromSalary}
	|
	|ORDER BY
	|	Date,
	|	LoanContract
	|AUTOORDER";
	
EndFunction

&AtServer
Procedure AccrualsServer()
	
	//receive accrual table on schedule
	QueryBuilder = New QueryBuilder(QueryTextByAccruals());
	QueryBuilder.Parameters.Insert("StartDate", StartDate);
	QueryBuilder.Parameters.Insert("EndDate",	EndDate);
	QueryBuilder.Parameters.Insert("Company",	Company);
	QueryBuilder.Parameters.Insert("Recorder",	Recorder);
	
	If OperationType = Enums.LoanAccrualTypes.AccrualsForLoansBorrowed Then
		QueryBuilder.Parameters.Insert("LoanKind", Enums.LoanContractTypes.Borrowed);
	Else
		QueryBuilder.Parameters.Insert("LoanKind", Enums.LoanContractTypes.EmployeeLoanAgreement);
	EndIf;
	
	If ValueIsFilled(Counterparty) Then
		NewFilter = QueryBuilder.Filter.Add("Lender");
		NewFilter.Set(Counterparty);
	EndIf;
	
	If ValueIsFilled(Employee) Then
		NewFilter = QueryBuilder.Filter.Add("Employee");
		NewFilter.Set(Employee);
	EndIf;
	
	If ValueIsFilled(LoanContract) Then
		NewFilter = QueryBuilder.Filter.Add("LoanContract");
		NewFilter.Set(LoanContract);
	EndIf;
	
	If OperationType = Enums.LoanAccrualTypes.AccrualsForEmployeeLoans AND 
		Not FillInByContractsWithRepaymentFromSalary Then
		NewFilter = QueryBuilder.Filter.Add("ChargeFromSalary");
		NewFilter.Set(False);
	EndIf;
	
	QueryBuilder.Execute();
	ScheduleAccruals = QueryBuilder.Result.Unload();
	
	Accruals = ScheduleAccruals.CopyColumns();
	Accruals.Columns.Add("AmountType", New TypeDescription("EnumRef.LoanScheduleAmountTypes"));
	
	For Each CurrentAccrual In ScheduleAccruals Do
	
		If CurrentAccrual.Interest <> 0 Then
			NewAccrualLine = Accruals.Add();
			FillPropertyValues(NewAccrualLine, CurrentAccrual);
			NewAccrualLine.Total = CurrentAccrual.Interest;
			NewAccrualLine.AmountType = Enums.LoanScheduleAmountTypes.Interest;
		EndIf;
		
		If CurrentAccrual.Commission <> 0 Then
			NewAccrualLine = Accruals.Add();
			FillPropertyValues(NewAccrualLine, CurrentAccrual);
			NewAccrualLine.Total = CurrentAccrual.Commission;
			NewAccrualLine.AmountType = Enums.LoanScheduleAmountTypes.Commission;
		EndIf;

	EndDo;
	
	AccrualAddressInStorage = PutToTempStorage(Accruals, UUID);
	
EndProcedure

#EndRegion

#EndRegion
